app/controllers/home_page_controller.rb

  def homepage
    if session[:user_id]
      @user = User.find_by_id(session[:user_id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1