app/controllers/leave_application_controller.rb

  def new
    @admins = []
    admins_obj = User.where(" role = 'Approver'")
    admins_obj.each do |a|
      @admins << [a.first_name + " " + a.last_name, a.id]
    end
    @user = User.find_by_id(session[:user_id])
---
SELECT `users`.* FROM `users` WHERE ( role = 'Approver')
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1

  def index
    @leaves = LeaveApplication.where("user_id = ?", current_user.id)
    authorize @leaves
    @leaves.each do |leave|
      leave.approver = User.find_by_id(leave.approver_user_id)
---
SELECT `leave_applications`.* FROM `leave_applications` WHERE (user_id = 2)
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1

  def show
    @leave = LeaveApplication.find_by_id(params[:id])
    authorize @leave
    @leave.approver = User.find_by_id(@leave.approver_user_id)
---
SELECT  `leave_applications`.* FROM `leave_applications` WHERE `leave_applications`.`id` = 1 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1

  def edit
    @leave = LeaveApplication.find_by_id(params[:id])
    authorize @leave
    @leave.applicant = User.find_by_id(@leave.user_id)
---
SELECT  `leave_applications`.* FROM `leave_applications` WHERE `leave_applications`.`id` = 1 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1

  def update
    leave = LeaveApplication.find_by_id(params[:id])
    authorize leave
    leave.approver_comment = get_edit_params[:approver_comment]
    leave.leave_status = get_edit_params[:leave_status]
    if leave.valid? && leave.save
---
SELECT  `leave_applications`.* FROM `leave_applications` WHERE `leave_applications`.`id` = 1 LIMIT 1
UPDATE `leave_applications` SET `approver_comment` = 'rthrth', `leave_status` = 'Approve', `updated_at` = '2018-08-06 11:53:16' WHERE `leave_applications`.`id` = 1

  def action_history
    @leaves = LeaveApplication.where("approver_user_id = ? and (leave_status = 'Approve' || leave_status = 'Reject')  ", current_user.id)
    authorize @leaves
      @leaves.each do |leave|
        leave.applicant = User.find_by_id(leave.user_id)
---
SELECT `leave_applications`.* FROM `leave_applications` WHERE (approver_user_id = 1 and (leave_status = 'Approve' || leave_status = 'Reject')  )
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1

  def worklist
    @leaves = LeaveApplication.where("approver_user_id = ? and leave_status = 'Apply'", current_user.id)
    authorize @leaves
    @leaves.each do |leave|
      leave.applicant = User.find_by_id(leave.user_id)
---
SELECT `leave_applications`.* FROM `leave_applications` WHERE (approver_user_id = 1 and leave_status = 'Apply')
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1

  def show_action
    @leave = LeaveApplication.where("id = ?", params[:id]).first
    authorize @leave
    @leave.applicant = User.find_by_id(@leave.user_id)
---
SELECT  `leave_applications`.* FROM `leave_applications` WHERE (id = '1') ORDER BY `leave_applications`.`id` ASC LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1