app/controllers/leave_system_controller.rb

  def new
    @admins = []
    admins_obj = User.where(" role = 'Admin'")
    admins_obj.each do |a|
      @admins << [a.first_name + " " + a.last_name, a.id]
    end
    @user = User.find_by_id(session[:user_id])
---
SELECT `users`.* FROM `users` WHERE ( role = 'Admin')
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1

  def create
    errors = []
    leave = LeaveApplication.new(get_params)
    leave.user_id = current_user.id
    leave.leave_status = 'Apply'
    if leave.valid?
      from = nil
      leave.from_date.upto(leave.to_date) do |date|
        if date.sunday? || date.saturday?
          next
        else
          if from.nil?
            from = date
          end
          leave.total_leaves +=1
          leave.to_date = date
        end
      leave.from_date = from
      end
      if leave.save
---
INSERT INTO `leave_applications` (`user_id`, `from_date`, `to_date`, `total_leaves`, `approver_user_id`, `reason`, `leave_status`, `created_at`, `updated_at`) VALUES (2, '2018-08-08', '2018-08-21', 10, 1, 'Going Home.', 'Apply', '2018-08-03 12:37:33', '2018-08-03 12:37:33')

  def index
    @leaves = LeaveApplication.where("user_id = ?", current_user.id)
    @leaves.each do |leave|
      leave.approver = User.find_by_id(leave.approver_user_id)
---
SELECT `leave_applications`.* FROM `leave_applications` WHERE (user_id = NULL)
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1

  def show
    @leave = LeaveApplication.find_by_id(params[:id])
    @leave.approver = User.find_by_id(@leave.approver_user_id)
---
SELECT  `leave_applications`.* FROM `leave_applications` WHERE `leave_applications`.`id` = 1 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1

  def edit
    @leave = LeaveApplication.find_by_id(params[:id])
    @leave.applicant = User.find_by_id(@leave.user_id)
---
SELECT  `leave_applications`.* FROM `leave_applications` WHERE `leave_applications`.`id` = 1 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1

  def update
    leave = LeaveApplication.find_by_id(params[:id])
    leave.approver_comment = get_edit_params[:approver_comment]
    leave.leave_status = get_edit_params[:leave_status]
    if leave.valid? && leave.save
---
SELECT  `leave_applications`.* FROM `leave_applications` WHERE `leave_applications`.`id` = 1 LIMIT 1
UPDATE `leave_applications` SET `approver_comment` = 'ok', `leave_status` = 'Approve', `updated_at` = '2018-08-03 12:44:22' WHERE `leave_applications`.`id` = 1

  def action_history
    @leaves = LeaveApplication.where("approver_user_id = ? and (leave_status = 'Approve' || leave_status = 'Reject')  ", current_user.id)
      @leaves.each do |leave|
        leave.applicant = User.find_by_id(leave.user_id)
---
SELECT `leave_applications`.* FROM `leave_applications` WHERE (approver_user_id = NULL and (leave_status = 'Approve' || leave_status = 'Reject')  )
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1

  def worklist
    @leaves = LeaveApplication.where("approver_user_id = ? and leave_status = 'Apply'", current_user.id)
    @leaves.each do |leave|
      leave.applicant = User.find_by_id(leave.user_id)
---
SELECT `leave_applications`.* FROM `leave_applications` WHERE (approver_user_id = NULL and leave_status = 'Apply')
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1

  def show_action
    @leave = LeaveApplication.where("id = ?", params[:id]).first
    @leave.applicant = User.find_by_id(@leave.user_id)
---
SELECT  `leave_applications`.* FROM `leave_applications` WHERE (id = '1') ORDER BY `leave_applications`.`id` ASC LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1